<?php
$today = getdate ();
$hour[1] = date("H");
$min[1] = date("i");
$today1[1]= date("H:i:s");
echo(" для проверки времени ___Текущее время: $today1[1] _____ ");

if (($hour[1]==1) || ($hour[1]==21) ) {
            echo(" Текущее время:  $hour[1]час и ");
} elseif (($hour[1]>=2) && ($hour[1]<=4) || ($hour[1]>=22) && ($hour[1]<=24)){
    echo(" Текущее время: $hour[1] часа и ");
}
else {
    echo(" Текущее время: $hour[1] часов и ");
}
if (($min[1]==1) || ($min[1]==21) || ($min[1]==31) || ($min[1]==41) || ($min[1]==51) ) {
    echo("$min[1] минута ");
} elseif (($min[1]>=2) && ($min[1]<=4) || ($min[1]>=22) && ($min[1]<=24) || ($min[1]>=32) && ($min[1]<=34)
    || ($min[1]>=42) && ($min[1]<=44) || ($min[1]>=52) && ($min[1]<=54)){
    echo("$min[1] минуты");
}
else {
    echo("$min[1] минут");
}

?>